{
  "2025": {
    "1": [
      "During Q1 2025, the Community Paramedicine program made significant strides in expanding service capacity and improving patient outcomes. With the addition of two new Emergency Medical Technicians (EMTs) in January, we increased our patient caseload by 59% (from 90 unique patients in Q4 2024 to 143 in Q1 2025), demonstrating immediate impact from enhanced staffing levels.\n\nKey achievements include:\n• Successfully contacted 43 of 45 individuals (95.5%) who experienced non-fatal overdoses, maintaining our strong overdose follow-up performance\n• Expanded intensive case management services to support patients with complex needs\n• Maintained strong referral coordination with 67 referrals received and 56 referrals initiated to community partners\n• Strengthened data quality and reporting systems to better track program outcomes\n\nAll program objectives were met this quarter. The increase in patient volume did not compromise service quality, as evidenced by our overdose follow-up rate remaining above 95%. No changes to evaluation methods or scope of work are needed at this time.",
      "The program continued its robust collaborative partnerships across the community:\n\n**OPCC/REdisCOVERY Partnership:** Our EMTs conduct weekly field outreach with OPCC (Olympic Peninsula Community Clinic) and REdisCOVERY staff every Thursday, typically reaching 325-450 individuals experiencing homelessness or substance use challenges. This multi-disciplinary approach combines medical assessment, harm reduction services, and immediate connection to treatment resources.\n\n**Law Enforcement Coordination:** We maintain strong relationships with Clallam County Sheriff's Office and Port Angeles Police Department for overdose response coordination and warm handoffs following behavioral health crises.\n\n**Healthcare System Integration:** Continued collaboration with Olympic Medical Center Emergency Department for hospital discharge follow-up and care transitions, ensuring continuity of care for high-utilizing patients.\n\n**Community-Based Organizations:** Regular coordination with Peninsula Behavioral Health, Serenity House of Clallam County, and local tribal health services to provide comprehensive wraparound services.\n\nThese collective impact strategies ensure we're meeting patients where they are—both literally and figuratively—with a coordinated network of support rather than fragmented services.",
      "The most pressing sustainability challenge this quarter is securing ongoing funding for the two EMT positions added in January 2025. These positions are currently funded through the end of 2025 only, creating uncertainty for Q1 2026 and beyond.\n\n**Bridge Funding Needs:** We are actively pursuing bridge funding sources to maintain staffing continuity while the Hargrove Grant application process proceeds. The 59% increase in patients served (90→143) and maintenance of high-quality outcomes demonstrate the ROI of these positions.\n\n**Other Funding Partnerships:**\n• Exploring Medicaid reimbursement pathways for community paramedicine services through the state Health Care Authority\n• Investigating opportunities with local hospital systems under value-based care contracts focused on reducing ED utilization\n• Coordinating with Peninsula Behavioral Health on potential Substance Abuse Block Grant alignment\n\n**New Collaborations:**\n• Initiated discussions with United Way of Clallam County regarding potential funding for harm reduction supplies and care coordination activities\n• Exploring partnership with Washington State University Extension for evaluation support and data analytics capacity building\n\nThe program has demonstrated clear value—58% reduction in high-utilizer ED visits among engaged patients—but requires sustained investment to maintain current service levels.",
      "**COAST Training Success:** In January 2025, we successfully launched the first Community Overdose Awareness & Stabilization Training (COAST) session in partnership with University of Washington and the Center for Rural Opioid Addiction (CROA). The inaugural training attracted a multi-disciplinary audience including EMTs, social workers, law enforcement, and community health workers. Feedback was overwhelmingly positive, with participants reporting increased confidence in overdose response and naloxone administration. This training model will be replicated quarterly throughout 2025.\n\n**Field Outreach Impact:** During a Thursday outreach session in February, our team encountered a 34-year-old individual experiencing homelessness who had been avoiding medical care for a severe foot infection. Through patient engagement and trust-building over multiple encounters, we successfully facilitated transport to the ED, connection with a primary care provider, and enrollment in intensive case management. This individual is now housed and engaged in both medical and behavioral health treatment—a testament to the persistence and compassion of our street medicine approach.\n\n**High-Utilizer Success:** One patient who had 47 ED visits in 2024 has had zero ED visits in Q1 2025 after enrollment in our intensive case management program. Through weekly home visits, medication management support, and coordination with their psychiatrist, this individual has achieved remarkable stability. This single success story represents approximately $94,000 in avoided healthcare costs based on average ED visit expenses.",
      ""
    ],
    "2": [
      "In Q2 2025, the Community Paramedicine Program achieved meaningful growth across multiple service domains. A total of 199 referrals were initiated, engaging 153 unique patients and resulting in 697 encounters—the highest quarterly activity recorded to date. This includes 173 referrals from standard sources and 26 additional referrals tied to post-overdose interventions.\n\nA total of 223 services were delivered across 35 unique service types, reflecting the diverse and personalized nature of the interventions. Notably, Community Paramedics initiated 142 referrals using qualifying outcomes indicating strong follow-through and resolution capacity.\n\nKey objectives around overdose response were also maintained: all non-CPM-hour overdose cases were referred for follow-up, and no repeat overdoses were recorded among the 26 overdose referrals—a significant indicator of intervention effectiveness.\n\nNo major objectives were left unmet this quarter. However, consistent with previous quarters, limitations persist in access to long-term placements for patients with complex behavioral health and substance use needs. While not a failure in execution, this remains a system-level barrier outside the immediate scope of the CPM team. There is no current need to change evaluation methods, though enhanced patient outcome tracking could improve our understanding of longer-term health trajectories post-referral.\n\nLast quarter we hired two Community EMTs. Their addition established two fully autonomous CPM & Post Overdose Response Units (PORT). With an extra unit on the road, our department increased its ability to:\n- Respond to more 911-dispatched overdoses.\n- Backfill emergency medical service gaps during high call volumes.\n- Broaden geographic reach to rural and underserved areas.\n- Support mutual aid calls to Fire Districts 2, 3, and 4.\n\nEach vehicle is ALS-equipped and operated by a two-person team. The staffing model is expected to include rotating coverage to ensure a steady CPM presence during non-traditional hours. Conservative projections estimate 300 third-out EMS responses annually by one unit alone—representing 5% of total call volume. This translates to an estimated $581,400 in annual billing revenue, further offsetting CPM costs.\n\nQ1 and Q2 2025 saw unprecedented gains:\n- Q1: 83 more referrals, 104 more encounters, and 53 more unique patients than Q4 2024.\n- Q2: 697 encounters, 199 referrals, and record-breaking outreach volumes (~600 unsheltered individuals engaged).\n\nThe increase in referrals, services, and follow-ups is directly tied to the increased capacity enabled by the two EMTs. Both units have also been integrated into training coverage, giving Firefighters time for skill refreshers and drills.",
      "The CPM Program continued to work hand-in-hand with a wide array of community partners in Q2 2025. Weekly outreach in partnership with Olympic Peninsula Community Clinic (OPCC) REdisCOVERY and Clallam County's Harm Reduction Center remained a cornerstone strategy, with estimated engagement reaching 400–600 individuals. These engagements involve medical services (wound care, frostbite treatment, prescription coordination, etc), basic needs distribution (hygiene kits, Narcan, emergency blankets, etc), and field-based assessments.\n\nCollective impact was evident in continued coordination with:\n- Reflections Counseling Services and Peninsula Behavioral Health for behavioral health follow-up.\n- Clallam County Jail, NOHN, and Jamestown Healing Clinic for MOUD linkage.\n- Law enforcement agencies, who participated in joint COAST training and collaborated on overdose response alignment under the Involuntary Treatment Act (ITA).\n\nThe Post-Overdose Response Team (PORT) maintained a unified front between EMS, law enforcement, and behavioral health professionals, enabling warm handoffs and avoiding punitive pathways for overdose survivors.",
      "The sustainability of the CPM Program remains a top priority as it scales to meet increasing demand. While the program's core Community Paramedic roles will be funded permanently in the coming years, the two newly added Community EMT positions are currently only funded through the end of 2025.\n\nWe do not have continued funding support from the University of Washington or CROA for these positions beyond 2025. To bridge the gap, the Port Angeles Fire Department is actively seeking temporary funding mechanisms—including local grants, interagency partnerships, and philanthropic sources—until the City of Port Angeles can absorb the cost of these full-time employees into the municipal budget.\n\nDespite the temporary nature of the funding, the impact of these EMTs has already been substantial:\n- Enabled a second fully autonomous Post Overdose Response Unit\n- Doubled field coverage and 911 backfill capacity\n- Contributed to record-setting quarters in terms of referrals, encounters, and patient reach\n\nThe case for sustainability is further strengthened by financial data:\n- The program continues to return an estimated $1.87 for every $1 invested in CPM staffing\n- Third-out transports facilitated by expanded units represent a potential $580K+ in annual billing revenue\n\nThis return on investment is being used to support ongoing discussions with city leadership and external funders, as we work to transition these vital roles into permanent infrastructure.",
      "Q2 2025 marked the successful delivery of an 8-hour COAST training to a cross-agency audience, including EMTs, Paramedics, Law Enforcement Officers, and visiting Chief Officers from regional fire departments. Developed in collaboration with the University of Washington and the Co-Responder Outreach Alliance (CROA), the training featured six core modules on integrated behavioral health response, overdose reversal, trauma-informed de-escalation, and legal coordination under the Involuntary Treatment Act (ITA).\n\nThe session was exceptionally well received and led to several key outcomes:\n- UW formally adopted modifications made by the Port Angeles team to the presentation slide decks—improving clarity, field relevance, and regional applicability.\n- Several attendees from neighboring agencies expressed interest in replicating both the training and the PORT model in their jurisdictions.\n- The training strengthened cross-agency rapport and reinforced the CPM program's role as a hub for integrated, patient-centered care delivery.\n\nIn the field, the expanded PORT unit also had a measurable impact. No repeat overdoses were recorded for the 26 patients referred after overdose events—a rare outcome reflecting successful engagement, follow-up, and care navigation. One particularly high-acuity individual transitioned from street-based living and episodic crisis calls to consistent care coordination and transitional housing, thanks to joint efforts between CPM, OPCC, and REdisCOVERY.",
      ""
    ],
    "3": [
      "During Q3 2025, the Community Paramedicine (CPM) and Post Overdose Response Team (PORT) programs operated at full capacity with two autonomous response units. The primary achievement this quarter was program stabilization at scale following rapid growth earlier in the year. CPMs sustained high-volume post-overdose follow-up, chronic care outreach, and behavioral health engagement while extending services into Clallam County Fire District 2 based on overdose heat-mapping data.\n\nEvaluation data showed continued reductions in repeat 911 utilization and emergency department use among enrolled clients, along with treatment linkage rates consistently near or above 75% when CPMs were present. No core objectives were unmet. The primary constraint identified was external system capacity, particularly delays in behavioral health placement and treatment admissions, which impacted the speed of downstream stabilization rather than CPM performance.\n\nNo changes to evaluation methods were required; however, data reinforced the need to continue prioritizing field-based engagement and follow-up, especially for patients who initially decline transport or treatment.",
      "Q3 emphasized deep operational collaboration rather than new partnership formation. CPM and PORT teams worked closely with Peninsula Behavioral Health, Olympic Medical Center, OPCC, REdisCOVERY, Reflections Counseling, law enforcement, and shelter-based providers to coordinate care for high-acuity individuals.\n\nRegular case coordination and warm handoffs ensured that overdose events consistently triggered follow-up engagement rather than ending at scene clearance. Expansion into Fire District 2 required close coordination with district EMS leadership and dispatch to align referral pathways and response expectations. This quarter demonstrated the effectiveness of shared ownership of outcomes across agencies, rather than siloed response.",
      "Sustainability planning in Q3 focused on documentation, validation, and alignment. Program leadership continued preparing for the transition of two Community Paramedic positions to full City funding in 2026, while assembling performance data and regional letters of support for continued grant-funded positions.\n\nEvaluation data from this quarter directly informed funding proposals submitted later in the year, reinforcing the program’s role in overdose fatality reduction, system cost avoidance, and regional EMS resilience. Sustainability efforts emphasized diversification of funding sources rather than reliance on a single grant stream.",
      "A recurring success story in Q3 involved individuals with repeated overdoses or frequent welfare checks who, through persistent CPM follow-up, transitioned from emergency-system reliance to direct engagement with case managers and treatment providers. In several cases, patients who had historically refused transport began accepting hospital care or MOUD referrals after building rapport with CPMs through repeated, non-punitive contact.",
      ""
    ],
    "4": [
      "Evaluation confirmed that Clallam County’s overdose fatality ranking had improved dramatically compared to early 2024, reflecting the sustained impact of PORT operations. Treatment linkage rates remained high and repeat overdose rates among engaged patients continued to decline.\n\nAll program objectives for the quarter were met or exceeded. No changes to scope of work were required. Evaluation confirmed that staffing stability and continuity of care were the most critical success factors, reinforcing the importance of sustaining the dual-unit CPM/PORT model.",
      "In Q4, the program focused on validating the feasibility and effectiveness of regional, cross-sector collaboration as services expanded beyond the City of Port Angeles. This effort was reflected in strong, active support from fire districts, law enforcement, hospitals, tribal leadership, EMS councils, and behavioral health providers. Select patients residing within newly proposed expanded service areas were actively referred into the program to demonstrate the operational viability and impact of the extension.\n\nOutreach continued in shelters, encampments, and community settings, with Community Paramedics serving as a consistent medical and behavioral health presence. Collective impact was demonstrated through shared outcomes, including faster scene clearance for EMS and law enforcement, improved continuity of care for patients, and reduced emergency utilization across partner systems.",
      "Sustainability planning accelerated in Q4. Funding pathways were secured or advanced, including City budget commitments, Behavioral Health funding requests, and regional grant applications. The City’s phased assumption of CPM staffing costs was finalized, providing long-term stability for half of the team while preserving grant-funded expansion capacity.",
      "One representative success involved an individual experiencing repeated overdoses, uncontrolled diabetes, and housing instability who had previously cycled through emergency responses without sustained engagement. Through PORT follow-up and coordinated outreach with LEAD partners, the patient re-engaged in treatment, completed inpatient care, and transitioned to structured follow-up with community providers.\n\nMore broadly, Q4 success stories reflected a systemic shift: first responders reported improved morale and effectiveness as overdose responses increasingly resulted in forward movement for patients, rather than repeat crisis calls.",
      ""
    ]
  }
}
