{
  "metrics": [
    {
      "id": "q1_transport_acceptance",
      "title": "Transport acceptance clusters",
      "stat": "72%",
      "detail": "21 of 30 overdose survivors accepted hospital transport during Q1 2025 incidents, leaving nine refusals to monitor for repeat activity.",
      "map_tip": "Flag addresses tied to transport refusals so PORT units can target return visits before repeat overdoses occur.",
      "source": "Services in Q1 2025 (January 1–March 31).docx"
    },
    {
      "id": "q1_treatment_linkage",
      "title": "Treatment linkage hotspots",
      "stat": "59%",
      "detail": "17 survivors entered detox or treatment following Q1 2025 follow-up, indicating 41% of mapped overdoses still need engagement.",
      "map_tip": "Layer treatment acceptance over hotspot clusters to prioritize outreach for neighborhoods with lower linkage rates.",
      "source": "Services in Q1 2025 (January 1–March 31).docx"
    },
    {
      "id": "q1_repeat_rate",
      "title": "Repeat overdose concentration",
      "stat": "12%",
      "detail": "Four of 30 Q1 2025 overdose cases repeated within the quarter, underscoring the value of tracking addresses with multiple activations.",
      "map_tip": "Use repeat markers to identify residences or encampments needing sustained navigator presence.",
      "source": "Services in Q1 2025 (January 1–March 31).docx"
    },
    {
      "id": "q2_zero_repeat",
      "title": "Follow-up coverage gains",
      "stat": "26 cases",
      "detail": "Q2 2025 saw 26 post-overdose referrals with zero repeat overdoses after PORT follow-up, coinciding with the second PORT unit deployment.",
      "map_tip": "Highlight the coverage footprint of dual PORT units to replicate the zero-repeat outcome in new districts.",
      "source": "2025 Q2 Hargrove Report.docx"
    },
    {
      "id": "port_on_scene",
      "title": "On-scene success rate",
      "stat": "70%",
      "detail": "PORT teams report a 70% success rate when arriving during an overdose response, emphasizing the importance of routing units to dense clusters quickly.",
      "map_tip": "Combine travel time isochrones with hotspot clusters to focus rapid deployment to areas that benefit most from on-scene PORT arrival.",
      "source": "Combined_CPM_Master_Document.docx"
    },
    {
      "id": "expanded_coverage",
      "title": "Expanded coverage impact",
      "stat": "72%",
      "detail": "Program refinements show a 72% transport acceptance rate and 23% higher treatment entry when CPMs respond on scene, supporting eastward expansion into Fire District #2.",
      "map_tip": "Overlay planned district expansion boundaries with hotspot density to stage future PORT response zones.",
      "source": "2026-27 Hargrove RFP Notes (edited).docx"
    }
  ]
}
